# WasSwapped Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReloadSwapOutInfo..::..WasSwapped Property
ReloadSwapOutInfo Class See Also
---
Whether the swap out was successful.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool WasSwapped { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WasSwapped As Boolean
	Get
```

Visual C++
---
```text
public:
property bool WasSwapped {
	bool get ();
}
```

# See Also
ReloadSwapOutInfo Class
Autodesk.Revit.DB Namespace